{
    "history": "The John Carroll and Jim O’Brien Clubhouse in Indio opened its doors to the community in 1966. Today, that one small clubhouse has grown into an organization comprised of a network of four full-service clubhouses, two boxing/athletic centers, and the Smilow Family Teen Center in Indio.",
    "mission": "Saving and enhancing the lives of young people, especially those with economic and/or social needs, by offering a safe haven and meaningful youth development programs provided by a caring and qualified staff.",
    "impact": "We strive to give our club members and our communities a better and brighter future. We meet kids and teens where they are and help them to take steps forward to reach their potential. By focusing on safety, academic support and character development.",
    "ourClubs": {
        "description": "Provide safe havens and a welcoming atmosphere for thousands of youth across the Coachella Valley. After school activities build leadership skills, encourage good citizenship, keep students engaged academically, promote physical activity, and champion community involvement. For more information on programs and services please contact your local clubhouse.",
        "clubs": [
            {
                "site": "John Carroll and Jim O’Brien Clubhouse",
                "image": "assets/images/bgc-indio.jpg",
                "description": "Our flagship clubhouse, began serving the community in 1966. The club currently serves 1,192  members. Directly next to Thomas Jefferson Middle School and just blocks from Van Buren Elementary School, the club boasts a newly renovated gymnasium and state-of-the-art teen center.",
                "location": {
                    "address": "83100 Date Avenue",
                    "city": "Indio, CA",
                    "zip": "92201"
                },
                "phone": "(760)-347-5712",
                "fax": "(760)-347-1192",
                "contactPerson": {
                    "name": "Tracy Reed",
                    "title": "Unit Director"
                },
                "email": "inbgcofcv@aol.com",
                "hours": {
                    "school": "2:00pm - 7:00pm",
                    "summer": "7:30am - 5:30pm"
                }
            },
            {
                "site": "President Gerald R. Ford Clubhouse",
                "image": "assets/images/bgc-laquinta.jpg",
                "description": "Is a great space that youth have been coming together after school for almost two decades. The programs give each member something to be excited about. The President Gerald R. Ford Clubhouse currently serves 1,584 youth in the LaQuinta community.",
                "location": {
                    "address": "49995 Moon River Drive",
                    "city": "La Quinta, CA",
                    "zip": "92253"
                },
                "phone": "(760)-564-5555",
                "fax": "(760)-564-5527",
                "contactPerson": {
                    "name": "Siah Nix",
                    "title": "Unit Director"
                },
                "email": "twopositive@dc.rr.com",
                "hours": {
                    "school": "2:00pm - 7:00pm",
                    "summer": "7:30am - 5:30pm"
                }
            },
            {
                "site": "Frank Foster & Palmer Powell Family Clubhouse",
                "image": "assets/images/bgc-coachella.jpg",
                "description": "Opened its doors in 2002 and now serves over 1,600 members. Located next to Bobby Duke Middle School and Palm View Elementary School in Coachella, this club hosts a variety of after-school and summer activities.",
                "location": {
                    "address": "85350 Bagdad Ave",
                    "city": "Coachella, CA",
                    "zip": "92236"
                },
                "phone": "(760)-398-5287",
                "fax": "(760)-398-8468",
                "contactPerson": {
                    "name": "Juanita Goodwin",
                    "title": "Unit Director"
                },
                "email": "cobgcofcv@aol.com",
                "hours": {
                    "school": "2:00pm - 7:00pm",
                    "summer": "7:30am - 5:30pm"
                }
            },
            {
                "site": "The Joel E. Smilow Clubhouse ",
                "image": "assets/images/bgc-mecca.jpg",
                "description": "Is a state-of-the-art facility where members can enjoy games, sports activities, technology, and more! Our Joel E. Smilow Clubhouse currently serves 1,678 youth in the city of Mecca.",
                "location": {
                    "address": "91391 66th Avenue",
                    "city": "Mecca, CA",
                    "zip": "92254"
                },
                "phone": "(760)-396-2380",
                "fax": "(760)-396-0260",
                "contactPerson": {
                    "name": "Ray Amador",
                    "title": "Unit Director"
                },
                "email": "meccaclub@verizon.net",
                "hours": {
                    "school": "2:00pm - 7:00pm",
                    "summer": "7:30am - 5:30pm"
                }
            }
        ]
    }
}
